benchmark/go-frameworks/results/20260924-102750/results/post/echo/r3/40000.txt
Running 40s test @ http://10.128.0.4:8084/api/devices
  16 threads and 512 connections
  Thread calibration: mean lat.: 1.095ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.091ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.083ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.099ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.110ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.088ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.095ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.086ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.089ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.065ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.075ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.092ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.071ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.076ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.095ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.098ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.02ms  566.77us  14.19ms   75.73%
    Req/Sec     2.62k   214.30     4.22k    67.85%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.98ms
 75.000%    1.31ms
 90.000%    1.61ms
 99.000%    3.06ms
 99.900%    5.01ms
 99.990%    7.66ms
 99.999%   12.77ms
100.000%   14.20ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.096     0.000000            1         1.00
       0.388     0.100000       119914         1.11
       0.557     0.200000       239223         1.25
       0.705     0.300000       358101         1.43
       0.843     0.400000       478155         1.67
       0.976     0.500000       596877         2.00
       1.042     0.550000       657091         2.22
       1.108     0.600000       716698         2.50
       1.174     0.650000       776646         2.86
       1.240     0.700000       836048         3.33
       1.308     0.750000       895434         4.00
       1.343     0.775000       925254         4.44
       1.380     0.800000       955543         5.00
       1.420     0.825000       984823         5.71
       1.469     0.850000      1014715         6.67
       1.530     0.875000      1044522         8.00
       1.566     0.887500      1059346         8.89
       1.606     0.900000      1074243        10.00
       1.652     0.912500      1089257        11.43
       1.708     0.925000      1104245        13.33
       1.773     0.937500      1119066        16.00
       1.811     0.943750      1126461        17.78
       1.856     0.950000      1133908        20.00
       1.910     0.956250      1141426        22.86
       1.978     0.962500      1148901        26.67
       2.073     0.968750      1156292        32.00
       2.143     0.971875      1160080        35.56
       2.233     0.975000      1163738        40.00
       2.355     0.978125      1167455        45.71
       2.501     0.981250      1171221        53.33
       2.665     0.984375      1174947        64.00
       2.761     0.985938      1176806        71.11
       2.865     0.987500      1178647        80.00
       2.981     0.989062      1180531        91.43
       3.109     0.990625      1182380       106.67
       3.263     0.992188      1184243       128.00
       3.351     0.992969      1185184       142.22
       3.445     0.993750      1186114       160.00
       3.555     0.994531      1187038       182.86
       3.683     0.995313      1187978       213.33
       3.833     0.996094      1188908       256.00
       3.921     0.996484      1189373       284.44
       4.021     0.996875      1189837       320.00
       4.131     0.997266      1190301       365.71
       4.267     0.997656      1190781       426.67
       4.423     0.998047      1191241       512.00
       4.507     0.998242      1191468       568.89
       4.623     0.998437      1191705       640.00
       4.739     0.998633      1191935       731.43
       4.863     0.998828      1192165       853.33
       5.035     0.999023      1192399      1024.00
       5.139     0.999121      1192517      1137.78
       5.251     0.999219      1192633      1280.00
       5.375     0.999316      1192749      1462.86
       5.547     0.999414      1192864      1706.67
       5.743     0.999512      1192984      2048.00
       5.839     0.999561      1193041      2275.56
       5.951     0.999609      1193098      2560.00
       6.091     0.999658      1193156      2925.71
       6.259     0.999707      1193215      3413.33
       6.467     0.999756      1193273      4096.00
       6.591     0.999780      1193302      4551.11
       6.783     0.999805      1193330      5120.00
       7.003     0.999829      1193361      5851.43
       7.207     0.999854      1193390      6826.67
       7.391     0.999878      1193418      8192.00
       7.503     0.999890      1193432      9102.22
       7.679     0.999902      1193447     10240.00
       7.979     0.999915      1193462     11702.86
       8.191     0.999927      1193476     13653.33
       8.511     0.999939      1193491     16384.00
       8.735     0.999945      1193498     18204.44
       9.711     0.999951      1193506     20480.00
      10.215     0.999957      1193513     23405.71
      10.831     0.999963      1193521     27306.67
      11.359     0.999969      1193527     32768.00
      11.687     0.999973      1193531     36408.89
      11.943     0.999976      1193534     40960.00
      12.191     0.999979      1193539     46811.43
      12.207     0.999982      1193542     54613.33
      12.439     0.999985      1193547     65536.00
      12.439     0.999986      1193547     72817.78
      12.527     0.999988      1193549     81920.00
      12.767     0.999989      1193551     93622.86
      13.023     0.999991      1193553    109226.67
      13.063     0.999992      1193554    131072.00
      13.143     0.999993      1193555    145635.56
      13.223     0.999994      1193556    163840.00
      13.271     0.999995      1193557    187245.71
      13.375     0.999995      1193558    218453.33
      13.535     0.999996      1193559    262144.00
      13.535     0.999997      1193559    291271.11
      13.655     0.999997      1193560    327680.00
      13.655     0.999997      1193560    374491.43
      13.695     0.999998      1193561    436906.67
      13.695     0.999998      1193561    524288.00
      13.695     0.999998      1193561    582542.22
      13.719     0.999998      1193562    655360.00
      13.719     0.999999      1193562    748982.86
      13.719     0.999999      1193562    873813.33
      13.719     0.999999      1193562   1048576.00
      13.719     0.999999      1193562   1165084.44
      14.199     0.999999      1193563   1310720.00
      14.199     1.000000      1193563          inf
#[Mean    =        1.021, StdDeviation   =        0.567]
#[Max     =       14.192, Total count    =      1193563]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1597064 requests in 40.00s, 263.49MB read
Requests/sec:  39928.58
Transfer/sec:      6.59MB